portal-info.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="debug" dumptraffic="true">

  <clients>
    <client host="localhost" cpu="1"   use_controller_vm="true" maxusers="400"/>
  </clients>

<servers>
 <server host="server"  port="443" type="ssl"/>
</servers>

  <load>
    <arrivalphase phase="1" duration="5000" unit="second">
      <users arrivalrate="50000" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>

 <session name="es_load" weight="1" type="ts_http">
  <set_option name="certificate">
    <certificate keyfile="/home/stack/certs/ac.key" certfile="/home/stack/certs/ac.pem"/>
  </set_option>
 <request>
       <http url="https://server/path to check" method="GET" >
       </http>
 </request>
    </session>
  </sessions>
</tsung>